Microchip-MPLAB-Harmony/csp/apps/afec/afec_polled_mode/firmware/src/packs/ATSAMV71Q21B_DFP/component/uart.h
/* -------- UART_WPMR : (UART Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define UART_WPMR_WPEN_Pos                    _U_(0)                                               /**< (UART_WPMR) Write Protection Enable Position */
#define UART_WPMR_WPEN_Msk                    (_U_(0x1) << UART_WPMR_WPEN_Pos)                     /**< (UART_WPMR) Write Protection Enable Mask */
#define UART_WPMR_WPEN(value)                 (UART_WPMR_WPEN_Msk & ((value) << UART_WPMR_WPEN_Pos))
#define UART_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (UART_WPMR) Write Protection Key Position */
#define UART_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << UART_WPMR_WPKEY_Pos)               /**< (UART_WPMR) Write Protection Key Mask */
#define UART_WPMR_WPKEY(value)                (UART_WPMR_WPKEY_Msk & ((value) << UART_WPMR_WPKEY_Pos))
#define   UART_WPMR_WPKEY_PASSWD_Val          _U_(0x554152)                                        /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define UART_WPMR_WPKEY_PASSWD                (UART_WPMR_WPKEY_PASSWD_Val << UART_WPMR_WPKEY_Pos)  /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define UART_WPMR_Msk                         _U_(0xFFFFFF01)                                      /**< (UART_WPMR) Register Mask  */


/** \brief UART register offsets definitions */
#define UART_CR_REG_OFST               (0x00)              /**< (UART_CR) Control Register Offset */
#define UART_MR_REG_OFST               (0x04)              /**< (UART_MR) Mode Register Offset */
#define UART_IER_REG_OFST              (0x08)              /**< (UART_IER) Interrupt Enable Register Offset */
#define UART_IDR_REG_OFST              (0x0C)              /**< (UART_IDR) Interrupt Disable Register Offset */
#define UART_IMR_REG_OFST              (0x10)              /**< (UART_IMR) Interrupt Mask Register Offset */
#define UART_SR_REG_OFST               (0x14)              /**< (UART_SR) Status Register Offset */
#define UART_RHR_REG_OFST              (0x18)              /**< (UART_RHR) Receive Holding Register Offset */
#define UART_THR_REG_OFST              (0x1C)              /**< (UART_THR) Transmit Holding Register Offset */
#define UART_BRGR_REG_OFST             (0x20)              /**< (UART_BRGR) Baud Rate Generator Register Offset */
#define UART_CMPR_REG_OFST             (0x24)              /**< (UART_CMPR) Comparison Register Offset */
#define UART_WPMR_REG_OFST             (0xE4)              /**< (UART_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UART register API structure */
typedef struct
{
  __O   uint32_t                       UART_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       UART_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   uint32_t                       UART_IER;           /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       UART_IDR;           /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       UART_IMR;           /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       UART_SR;            /**< Offset: 0x14 (R/   32) Status Register */
  __I   uint32_t                       UART_RHR;           /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O   uint32_t                       UART_THR;           /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  uint32_t                       UART_BRGR;          /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO  uint32_t                       UART_CMPR;          /**< Offset: 0x24 (R/W  32) Comparison Register */
  __I   uint8_t                        Reserved1[0xBC];
  __IO  uint32_t                       UART_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} uart_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMV71_UART_COMPONENT_H_ */
